'''
Трикутник задається координатами своїх вершин на площині:  . Визначити, чи є цей трикутник рівнобедреним.
'''
x1 = int(input('x1 - '))
y1 = int(input('y1 - '))
x2 = int(input('x2 - '))
y2 = int(input('y2 - '))
x3 = int(input('x3 - '))
y3 = int(input('y3 - '))
a = ((x2-x1)**2+(y2-y1)**2)**(1/2)
b = ((x2-x3)**2+(y2-y3)**2)**(1/2)
c = ((x3-x1)**2+(y3-y1)**2)**(1/2)
if c**2==b**2:
    print('Рівнобедрений')
elif c**2==a**2:
    print('Рівнобедрений')
elif b**2==a**2:
    print('Рівнобедрений')
else:
    print('Не рівнобедрений')
